
/***************************************************************
* 文件名		 ：
* 描述	         : 
* 输入           : 
* 输入           : 
* 输入           : 
* 输出           : 
* 返回           : 
***************************************************************/

#include "TimeEvt.h"

/****************************  宏定义 **************************/


/**************************** 类型构造**************************/

/**************************** 内部声明**************************/

//static TimeEvtType eQueuedEvent;
static BOOL           xEventInQueue;

/**************************** 私有变量**************************/


/**************************** 功能函数**************************/



/***************************************************************
* 函数名		 ：
* 描述	         : 
* 输入           : 
* 输入           : 
* 输入           : 
* 输出           : 
* 返回           : 
***************************************************************/
BOOL TimeEventInit( void )
{
    xEventInQueue = FALSE;
    return TRUE;
}

BOOL TimeEventPost( void )
{
  xEventInQueue = TRUE;
  return TRUE;
}

BOOL TimeEventGet( void )
{
  if(xEventInQueue==TRUE)
	{
		xEventInQueue=FALSE;
		return TRUE;
	}
	else
	{
		return FALSE;
	}
}

